{"Product Name": "Nintendo Switch™ with Neon Blue and Neon Red Joy‑Con™ (New Box)", "Image": "https://m.media-amazon.com/images/I/71pIS8f417L.__AC_SY300_SX300_QL70_ML2_.jpg", "Rating": "4.8", "Description": "                             <hr>\n                            <h1 class=\"a-size-base-plus a-text-bold\">  </h1>                                  <ul class=\"a-unordered-list a-vertical a-spacing-mini\">  <li class=\"a-spacing-mini\"><span class=\"a-list-item\"> The Nintendo Switch combines the mobility of a handheld with the power of a home gaming system, offering unprecedented gaming and entertainment experiences  </span></li>  <li class=\"a-spacing-mini\"><span class=\"a-list-item\"> The Nintendo Switch and Dock connects the system to the TV and lets you play with your family and friends in the comfort of your living room  </span></li>  <li class=\"a-spacing-mini\"><span class=\"a-list-item\"> With a bright, high-definition display Nintendo Switch lets you bring your at-home gaming experience with you anywhere; to the Park, on an airplane, in a car -- anywhere  </span></li>  <li class=\"a-spacing-mini\"><span class=\"a-list-item\"> Attach the Joy-Con controllers to either side of Nintendo Switch for solo gaming on the go or detach them from Switch and use a Joy-Con controller in each hand  </span></li>  <li class=\"a-spacing-mini\"><span class=\"a-list-item\"> With multiple Joy-Con controllers from a number of systems (each sold separately), numerous people can gather for a variety of gameplay options  </span></li>  </ul>   <!-- Loading EDP related metadata -->\n                     ", "Pros": "• Easy setup: The Switch is easy to set up and use.\n    \n• Fun for the whole family: The Switch is a great console for people of all ages.\n    \n• Great selection of games: There is a wide variety of games available for the Switch, catering to all interests.\n    \n• Portable: The Switch can be played both at home and on the go.\n    \n• Affordable: The Switch is a relatively affordable console, making it a good option for families on a budget.", "Cons": "• Console does not work: Some users reported that the console does not work at all, or that it does not download games properly.\n\n• Console is used: Some users received a used console instead of a new one.\n\n• Console is damaged: Some users received a console that was damaged or scratched.\n\n• Controller does not work: Some users reported that the controller does not work properly, or that it sticks or stutters.\n\n• Small screen: Some users found the screen to be too small for comfortable gaming.\n\n• Games are expensive: Some users found the games to be expensive, especially when compared to other consoles.", "Pricing": "• Easy to set up: Many consumers found the Nintendo Switch to be easy to set up and use.\n        \n• Great for families: Some consumers noted that the Nintendo Switch was a great option for families, as it offered a variety of games that could be enjoyed by people of all ages.\n        \n• Fun and engaging: Many consumers found the Nintendo Switch to be a fun and engaging console.", "Quality": "• Mostly positive reviews: Consumers gave mostly positive reviews for the product. They found it easy to set up and use, and their children enjoyed playing games on it.\n        \n• Some reports of controller issues: A few consumers reported that the controllers would disconnect occasionally, but they were able to turn them back on.", "Performance": "• Great value for the money: Many reviewers praised the Nintendo Switch as a great value for the money, noting that it offers a variety of features and games at a reasonable price.\n    \n• Easy to set up and use: Consumers also found the Switch to be easy to set up and use, with many people noting that they were able to get started playing games right away.\n    \n• Fun for the whole family: Several reviewers noted that the Switch is a great way to entertain the whole family, with a variety of games that appeal to different ages and interests.", "Reliability": "• Easy setup and use: Several users reported that the Switch was easy to set up and use, with no issues connecting to their televisions or downloading games.\n    \n• Great for families: Many users noted that the Switch is a great console for families, with a variety of games to choose from that appeal to all ages.\n    \n• Compact and portable: Several users also appreciated the Switch's compact and portable design, making it easy to take with them on the go.\n    \n• Occasional controller disconnect: One user reported that the controllers would occasionally disconnect, but this was easily fixed by turning them back on."}